In [2]:
import numpy as np
from pandas import DataFrame,Series
import pandas as pd

In [17]:
df1=DataFrame([200,300,400],index=['me','you','him'],columns=['Age'])
df1

     Age
me   200
you  300
him  400

In [27]:
df2=DataFrame([[2,4,5],[7,8,6],[8,4,10]],index=['you','me','him'],columns=['Food','Clothing','Rolls'])
df2

     Food  Clothing  Rolls
you     2         4      5
me      7         8      6
him     8         4     10

In [47]:
s=df2[['Clothing','Rolls']]
s

     Clothing  Rolls
you         4      5
me          8      6
him         4     10

In [48]:
df2.iloc[1]

Food        7
Clothing    8
Rolls       6
Name: me, dtype: int64

In [49]:
df2

     Food  Clothing  Rolls
you     2         4      5
me      7         8      6
him     8         4     10

In [50]:
df2.loc['me']

Food        7
Clothing    8
Rolls       6
Name: me, dtype: int64

In [51]:
df2.head(2)

     Food  Clothing  Rolls
you     2         4      5
me      7         8      6

In [52]:
df2.tail(1)

     Food  Clothing  Rolls
him     8         4     10